app/controllers/api/v1/auth/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`uid` = 'WDzn2cqQh7QFg2PPGRVGk1Cbcmx1' LIMIT 1
---
        def create
          FirebaseIdToken::Certificates.request
          raise ArgumentError, 'BadRequest Parameter' if payload.blank?
          @user = User.find_or_initialize_by(uid: payload['sub']) do |user|